# -*- mode: ruby; -*-

tap 'borkdude/brew' # clj-kondo
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts' # hack nerd font
tap 'homebrew/core'

## Casks
cask '1password'
cask 'aerial'
cask 'alfred'
cask 'bartender'
cask 'dash'
cask 'daisydisk'
cask 'discord'
cask 'divvy'
cask 'docker'
cask 'emacs'
cask 'font-hack-nerd-font'
cask 'gpg-suite' # gpg-tools
cask 'intel-power-gadget' # For CPU frequency in iStat Menus
cask 'istat-menus'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'mattermost'
cask 'proxyman'
cask 'syncthing'
cask 'viscosity'

## App Store
mas 'Deliveries', id: 290986013
mas 'Things', id: 904280696

## Services
brew 'elasticsearch@7', restart_service: :changed, link: true
brew 'postgresql@9.6', restart_service: :changed, link: true
brew 'redis', restart_service: :changed
brew 'riemann', restart_service: :changed

## Dev tools
brew "multimarkdown"
brew 'aspell'
brew 'bash'
brew 'bash-completion@2'
brew 'bat'
brew 'borkdude/brew/babashka'
brew 'borkdude/brew/clj-kondo'
brew 'clojure'
brew 'cmake'
brew 'coreutils'
brew 'curl'
brew 'diff-so-fancy'
brew 'fd'
brew 'git'
brew 'htop'
brew 'jq'
brew 'leiningen'
# For the system Java wrappers to find this JDK, symlink it with
#  sudo ln -sfn /usr/local/opt/openjdk@11/libexec/openjdk.jdk /Library/Java/JavaVirtualMachines/openjdk-11.jdk
brew 'openjdk@11'
brew 'pass'
brew 'ripgrep'
brew 'shellcheck'
brew 'sk'
brew 'terminal-notifier'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'watch'

## Other
brew 'exercism'
brew 'rustup'
